insert into settlement (name, type, former_postal_code)
values ('Казань', 'город', 420),
       ('Москва', 'город', 101),
       ('Караганда', 'деревня', 200),
       ('Кизнер', 'поселок', 427);

insert into street (name, type, latter_postal_code, settlement_id)
values ('Каспийская', 'улица', 088, 1),
       ('Губкина', 'улица', 088, 1),
       ('Гвардейский', 'тракт', 001, 1),
       ('Кошайская', 'аллея', 011, 1),
       ('Озерский', 'бульвар', 121, 2),
       ('Каменская', 'улица', 021, 2),
       ('Озерский', 'тракт', 401, 2),
       ('Речной', 'бульвар', 801, 3),
       ('Новый', 'тракт', 071, 3),
       ('Старый', 'тракт', 071, 4),
       ('Орский', 'проспект', 071, 4);

insert into house (number, street_id)
values (91, 1),
       (11, 1),
       (51, 1),
       (24, 2),
       (31, 5),
       (15, 5),
       (16, 6),
       (11, 7),
       (14, 8),
       (12, 9),
       (21, 9);

insert into tenant (full_name)
values ('Иванов Иван Иванович'),
       ('Сидоров Сидор Сидорович'),
       ('Александров Александр Александрович'),
       ('Александров Александр Александрович'),
       ('Никитин Никита Никитович'),
       ('Краснов Красен Краснович'),
       ('Краснов Красен Краснович'),
       ('Краснов Красен Краснович'),
       ('Филиппов Филипп Филиппович');

insert into house_tenant (house_id, tenant_id)
values (1, 1),
       (1, 3),
       (1, 5),
       (2, 7),
       (2, 8),
       (2, 3),
       (3, 3),
       (4, 8),
       (4, 2),
       (4, 7),
       (5, 1),
       (6, 9),
       (7, 6),
       (7, 1),
       (8, 8),
       (9, 1),
       (9, 6),
       (10, 4),
       (10, 7),
       (10, 1),
       (11, 9);